{
  "posts": [
    {
      "title": "The Changing Guard: Tudor’s Tottenham Gamble, Alcaraz’s Ascent, and England’s T20 Statement",
      "slug": "2026-02-14-sports-report",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "An investigative report on the major sports shifts of Feb 14, 2026, covering Tottenham's new manager, Alcaraz's tennis dominance, and England's T20 World Cup progress.",
      "path": "/posts/2026-02-14-sports-report.md"
    },
    {
      "title": "The Eden Gardens Audit: T20 World Cup Fractures, the European Playoff Fatigue, and the Doha Coronation",
      "slug": "2026-02-14-eden-gardens-audit-t20-world-cup-analysis",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "An investigative look at the T20 World Cup expansion drama at Eden Gardens, the European football 'Playoff Fatigue' crisis, and the crowning of champions in Doha.",
      "path": "/posts/2026-02-14-eden-gardens-audit-t20-world-cup-analysis.md"
    },
    {
      "title": "The February 14th Cross-Continental Investigation: Cricket’s T20 Siege, the FA Cup Identity Crisis, and the Dallas-Rotterdam Pivot",
      "slug": "2026-02-14-t20-world-cup-fa-cup-tennis-investigation",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "A deep dive into the global sports landscape of Feb 14, 2026, featuring the T20 World Cup drama in Colombo, the FA Cup's soul-searching, and the elite tennis surge in Dallas and Rotterdam.",
      "path": "/posts/2026-02-14-t20-world-cup-fa-cup-tennis-investigation.md"
    },
    {
      "title": "Super Saturday: Champions League Fever, Border-Gavaskar Intensity, and Rotterdam Quarter-Finals",
      "slug": "2026-02-14-sports-roundup",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "A comprehensive investigative report on the Champions League play-offs, the grueling Border-Gavaskar Trophy, and the ATP Rotterdam Open.",
      "path": "/posts/2026-02-14-sports-roundup.md"
    },
    {
      "title": "The Sovereign Saturday: Kolkata’s T20 Siege and the FA Cup’s Identity Crisis",
      "slug": "2026-02-14-kolkata-t20-siege-fa-cup-investigation",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "An investigative deep dive into the global sports landscape of Feb 14, 2026, covering the T20 World Cup, FA Cup struggles, and the post-Super Bowl LX era.",
      "path": "/posts/2026-02-14-kolkata-t20-siege-fa-cup-investigation.md"
    },
    {
      "title": "Global Sports Revolution: Alcaraz Conquers Melbourne, Zimbabwe Stuns Cricket World, and ISL Kicks Off",
      "slug": "global-sports-report-feb-14-2026",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "Carlos Alcaraz completes a career Grand Slam in Melbourne, Zimbabwe scripts a historic T20 World Cup upset, and the ISL 2026 season launches in Kolkata.",
      "path": "/posts/global-sports-report-feb-14-2026.md"
    },
    {
      "title": "The Mid-Tournament Audit: T20 World Cup Analytics and the European Football Pivot",
      "slug": "2026-02-14-mid-tournament-audit-sports-analytics",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "A deep dive into the 2026 T20 World Cup data revolution, the England-Scotland tactical duel in Kolkata, and the looming European football fatigue crisis.",
      "path": "/posts/2026-02-14-mid-tournament-audit-sports-analytics.md"
    },
    {
      "title": "The T20 Boycott, Transfer Echoes, and the Rise of the ‘Teen Titans’: A Global Sports Investigation",
      "slug": "2026-02-14-t20-boycott-football-transfers-tennis-titans",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "A deep dive into the T20 World Cup boycott, post-transfer football economics, and the generational shift in tennis led by Alcaraz and the 'Teen Titans'.",
      "path": "/posts/2026-02-14-t20-boycott-football-transfers-tennis-titans.md"
    },
    {
      "title": "The Geopolitical Gridiron: Michael Vaughan’s India-Pakistan Gamble and the Re-Engineering of the European Season",
      "slug": "2026-02-14-geopolitical-gridiron-sports-editorial",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "An investigative deep dive into the shifting geopolitical and economic structures of global sport, featuring analysis of the India-Pakistan Test proposal and the ISL 2025-26 kickoff.",
      "path": "/posts/2026-02-14-geopolitical-gridiron-sports-editorial.md"
    },
    {
      "title": "Global Sports Pulse: Premier League Drama, India-Australia Rivalry & Tennis Finals",
      "slug": "2026-02-14-global-sports-pulse",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "A deep dive into the weekend's major sports stories, from the Premier League's Matchweek 26 to the Qatar TotalEnergies Open finals and the burgeoning India-Australia cricket rivalry.",
      "path": "/posts/2026-02-14-global-sports-pulse.md"
    },
    {
      "title": "Global Sports Saturday: Zimbabwe Stun Australia in T20 World Cup as ISL Returns",
      "slug": "zimbabwe-stuns-australia-t20-world-cup-isl-2026-opener",
      "date": "2026-02-14",
      "author": "Senior Investigative Sports Editor",
      "excerpt": "A massive upset in Colombo as Zimbabwe outclass Australia, while the ISL returns and India prepares for a high-stakes clash with Pakistan.",
      "path": "/posts/zimbabwe-stuns-australia-t20-world-cup-isl-2026-opener.md"
    },
    {
      "title": "2026 T20 World Cup Fixtures: Winners and Losers in the Fight for Associate Cricket Growth",
      "slug": "2026-t20-world-cup-analysis",
      "date": "2026-02-13",
      "author": "Investigative Sports Unit",
      "excerpt": "A YoSinTV investigation into the 2026 T20 World Cup schedule reveals a troubling disparity between host nation comforts and the logistical nightmares faced by associate nations.",
      "path": "/posts/2026-t20-world-cup-analysis.md"
    }
  ]
}
